Revit 2027 API
ParameterTypeId.ConnectorEngagementLength Property
 "Engagement Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConnectorEngagementLength { get; }
Public Shared ReadOnly Property ConnectorEngagementLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConnectorEngagementLength {
	ForgeTypeId^ get ();
}
static member ConnectorEngagementLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace